import Image from "next/image";
import { ImageCarousel } from "../../imageCarousel";
import ImageGrid from "../../imageGrid";

const left = [
    "खुशी, स्वास्थ्य, शान्तिका साथ ऊर्जाशील जीवन जिउन चाहनेहरू",
    "आफ्नो जीवनलाई बाह्य तथा आन्तरिक रूपमा रूपान्तरण गर्न चाहनेहरू ।",
    "आफूमै लुकेको क्षमता, प्रतिभा चिन्न र प्रस्फुटन गर्न चाहनेहरू ।",
];

const right = [
    "कुंठा, निराशा, कठोरता, भय, अनिश्चितताजस्ता समस्याबाट अलग रहन चाहनेहरू ।",
    "गहिरो आध्यात्मिक साधना गर्न चाहनेहरू ।",
    "आध्यात्मिक साधना र आरोग्यको खोजीमा रहेका आन्तरिक तथा बाह्य पर्यटकहरू ।",
];

const locationDetails = [
    { "key": "1", "label": "काठमाण्डौबाट करिब २५ किलोमिटर पश्चिम तथा पृथ्वी राजमार्गबाट १.५ किलोमिटर दक्षिणतर्फ रहेको ।" },
    { "key": "2", "label": "धादिङ जिल्लाको थाक्रे गाउँपालिकाको वडा नं. ७ मा ७९ रोपनी क्षेत्रफलमा धाम निर्माण भईरहेको ।" },
    { "key": "3", "label": "मनोरम पहाडी श्रृङ्खलाहरुका साथ शुद्ध र शान्त वातावरण भएको ।" },
    { "key": "4", "label": "गहिरो साधनाका लागि कोलाहल मुक्त र एकान्त स्थान ।" },
    { "key": "5", "label": "काठमाण्डौको भीडबाट अलग तर सहज यात्राका साथ पुग्न सकिने ।" }
]

const features = [
    { "key": "1", "label": "पार्किङ" },
    { "key": "2", "label": "जानकारी तथा सूचना केन्द्र" },
    { "key": "3", "label": "मन्दिर - १ + उपहार पसल ब्लक" },
    { "key": "4", "label": "आवासीय अपार्टमेन्ट प्रकार १" },
    { "key": "5", "label": "आवासीय अपार्टमेन्ट प्रकार २" },
    { "key": "6", "label": "क्यान्टिन तथा विभागीय पसल" },
    { "key": "7", "label": "छात्रावास + भुक्तानी गर्नुपर्ने कोठाहरु" },
    { "key": "8", "label": "गाई गोठ क्षेत्र" },
    { "key": "9", "label": "स्वास्थ्य तथा सन्तुलन केन्द्र" },
    { "key": "10", "label": "मन्दिर - २" },
    { "key": "11", "label": "अग्रीम कार्यालय" },
    { "key": "12", "label": "भान्सा, भोजन तथा स्टाफ क्वार्टर" },
    { "key": "13", "label": "सम्मेलन हल + शौचालय ब्लक" },
    { "key": "14", "label": "ध्यान सभाहल" },
    { "key": "15", "label": "मुख्य कार्यालय" },
    { "key": "16", "label": "विशेष अतिथि निवास" },
    { "key": "17", "label": "गुरु निवास" },
    { "key": "18", "label": "खुला रंगमञ्च (एम्फिथिएटर)" },
    { "key": "19", "label": "हेलिप्याड" },
    { "key": "20", "label": "खुला ध्यान क्षेत्र" }
]

export default function DhamDetails() {
    return (
        <section className="bg-white">
            <section className={"flex flex-col gap-[16px] relative before::content-none before:absolute before:top-0 before:left-0 before:w-full before:h-full before:opacity-[0.5] before:bg-[url('/assets/dham_arch_bg.png')] before:bg-cover before:bg-center before:bg-no-repeat max-md:gap-[20px]"}>
                <section className={"absolute -top-[161px] -right-[157px] flex items-center justify-center"}>
                    <div className={"w-[315px] h-[322px] relative flex items-center justify-center max-md:w-[86px] max-md:h-[89px]"}>
                        <Image fill
                            src={"/assets/chakra_right_white.svg"}
                            alt={"chakra"}
                            className="animate-[spin_20s_linear_infinite]"
                            style={{ transformOrigin: "50% 50%" }} />
                    </div>
                </section>

                {/*dham architecture section*/}
                <section
                    className={"z-1 relative pl-[150px] py-[60px] flex flex-col gap-[30px] before::content-none before:absolute before:top-0 before:left-0 before:w-full before:h-full before:opacity-[0.2] before:bg-[url('/assets/dham_architecture_bg.png')] before:-z-1 before:bg-cover bg-no-repeat max-xl:pl-[5%] max-md:p-[20px]"}>
                    <div className={"flex flex-col gap-[20px] max-md:gap-[12px] max-md:items-center max-md:justify-center"}>
                        <svg width="40" height="24" className={"w-[40px] h-[24px] max-md:w-[24px] max-md:h-[14px]"} viewBox="0 0 40 24"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M18.4667 1.05122C17.5452 2.17497 15.6799 5.00682 15.4327 5.63612C15.3428 5.90582 15.6125 6.19799 16.3541 6.69244C17.3655 7.34422 18.9162 8.78261 19.6578 9.77151C19.9725 10.1761 20.0174 10.1985 20.2197 9.83894C20.7591 8.93994 21.703 7.99599 23.0515 7.05204C23.8381 6.49017 24.4898 5.88334 24.4898 5.72602C24.4898 5.34394 22.0401 1.65805 21.1636 0.714099C20.1747 -0.31975 19.5679 -0.252324 18.4667 1.05122Z"
                                fill="#B8282E" />
                            <path
                                d="M11.6584 1.65842C11.0516 1.95059 10.8043 3.18671 11.2538 3.72611C11.5685 4.10819 12.827 4.15314 13.2091 3.77106C13.5687 3.41146 13.5462 2.13039 13.2091 1.86069C12.6697 1.45614 12.1977 1.38872 11.6584 1.65842Z"
                                fill="#B8282E" />
                            <path
                                d="M27.2338 1.59124C25.8629 2.10817 26.2225 4.04102 27.7058 4.04102C28.6272 4.04102 28.9868 3.70389 28.9868 2.78242C28.9868 1.77104 28.2002 1.23164 27.2338 1.59124Z"
                                fill="#B8282E" />
                            <path
                                d="M4.82767 6.15283C4.46808 6.40005 4.44561 6.66975 4.55798 8.243C4.69282 10.1084 5.25468 12.9178 5.5918 13.4347C5.74912 13.6819 6.01881 13.6819 7.165 13.4572C7.90666 13.3223 9.30007 13.2549 10.244 13.2999L11.9296 13.4122L11.7947 11.8165C11.7273 10.7827 11.7722 9.70387 11.997 8.75992C12.1543 7.95083 12.2667 7.23163 12.2217 7.14173C12.0644 6.91698 8.33367 6.13035 6.71552 5.97303C5.65922 5.9056 5.09736 5.95055 4.82767 6.15283Z"
                                fill="#B8282E" />
                            <path
                                d="M32.3592 6.08605C31.4377 6.19842 30.0219 6.46812 29.2128 6.69287L27.752 7.09742L27.8643 7.86157C27.9317 8.2886 27.9767 9.70452 27.9767 11.0081V13.3679H30.2241C31.4602 13.3679 32.8986 13.4578 33.4155 13.5477L34.3369 13.7275L34.7864 11.7497C35.0561 10.6709 35.3258 9.05275 35.4157 8.17622C35.5281 6.8502 35.4831 6.53555 35.1685 6.2209C34.9662 6.01862 34.6291 5.8613 34.4268 5.8613C34.2246 5.88377 33.2806 5.97367 32.3592 6.08605Z"
                                fill="#B8282E" />
                            <path
                                d="M14.2891 8.80552C14.2217 9.0977 14.1543 10.0866 14.1543 11.0081C14.1543 12.8735 14.7611 14.5142 15.75 15.4132C16.3118 15.9301 17.7727 16.8516 17.9974 16.8516C18.3345 16.8516 18.6941 14.7389 18.5817 13.5702C18.4244 12.0194 17.6603 10.6934 16.1545 9.34492C14.8735 8.17622 14.4914 8.08632 14.2891 8.80552Z"
                                fill="#B8282E" />
                            <path
                                d="M24.0656 9.09692C22.9194 10.0184 21.9755 11.2545 21.5934 12.3333C21.2788 13.2997 21.2788 15.2101 21.5934 16.1316C21.8181 16.7609 21.8856 16.8058 22.4474 16.6036C23.3015 16.3114 24.7848 14.8505 25.2792 13.7942C25.9759 12.3333 26.0209 8.31029 25.3241 8.31029C25.1668 8.31029 24.605 8.66989 24.0656 9.09692Z"
                                fill="#B8282E" />
                            <path
                                d="M0.377666 12.7613C-0.453885 13.6603 0.175397 15.0537 1.41149 15.0537C2.04077 15.0537 2.69252 14.3345 2.69252 13.6603C2.69252 13.0984 1.88345 12.3567 1.27664 12.3567C0.984473 12.3567 0.579935 12.5365 0.377666 12.7613Z"
                                fill="#B8282E" />
                            <path
                                d="M37.6843 12.7613C36.8528 13.6603 37.482 15.0537 38.7181 15.0537C39.3474 15.0537 39.9992 14.3345 39.9992 13.6603C39.9992 13.0984 39.1901 12.3567 38.5833 12.3567C38.2911 12.3567 37.8866 12.5365 37.6843 12.7613Z"
                                fill="#B8282E" />
                            <path
                                d="M8.19637 15.615C8.08399 15.6599 7.70193 15.7498 7.34234 15.8172C6.78048 15.9521 6.75801 16.0195 6.98275 16.4465C7.38729 17.2107 9.25266 19.0986 9.92689 19.4582C11.0057 20.0201 12.7137 20.2448 13.9273 19.9751C14.5566 19.8403 15.096 19.638 15.1859 19.5256C15.3882 19.1885 14.2195 17.368 13.3655 16.7162C12.1519 15.7948 9.40998 15.2104 8.19637 15.615Z"
                                fill="#B8282E" />
                            <path
                                d="M28.1345 15.9073C26.831 16.3793 25.6623 17.3682 25.033 18.5593C24.5161 19.5033 24.7184 19.7505 26.1792 20.0202C28.6289 20.4697 31.0112 19.2785 32.7642 16.7164C33.2137 16.0421 33.2362 15.9972 32.8541 15.8399C31.8652 15.4578 29.3256 15.4803 28.1345 15.9073Z"
                                fill="#B8282E" />
                            <path
                                d="M18.7163 19.8856C18.0421 20.3575 17.8398 21.5487 18.2893 22.4252C19.368 24.4929 22.6268 22.9646 21.7953 20.7846C21.6604 20.425 21.3907 20.0204 21.166 19.8631C20.6491 19.4585 19.3006 19.481 18.7163 19.8856Z"
                                fill="#B8282E" />
                        </svg>

                        <h2 className={"text-[36px] leading-relaxed font-semibold text-jv-text-black max-md:text-[20px]"}>
                            धामको संरचना र सुविधाहरू
                        </h2>
                    </div>

                    <div className="flex items-center gap-[25px] max-md:gap-[30px] max-md:flex-col">
                        <div className={"flex-1 max-md:w-full"}>
                            <div className={"flex gap-[37px] mt-[30px] max-md:gap-[10px] max-sm:flex-col max-md:m-0 max-md:justify-around"}>
                                <div className={"flex flex-col gap-[25px] max-md:gap-[10px]"}>
                                    {features.slice(0, 10).map((item, index) => (
                                        <div key={item.key}
                                            className={"flex items-center gap-[16px]"}>
                                            <div
                                                className={"w-[30px] h-[30px] border border-dashed border-jv-red rounded-full flex items-center justify-center max-md:w-[24px] max-md:h-[24px]"}>
                                                <div
                                                    className={"w-[24px] h-[24px] border border-jv-red rounded-full flex items-center justify-center text-[14px] leading-[15px] max-md:text-[12px] text-jv-red max-md:w-[19px] max-md:h-[19px]"}>
                                                    <span className="translate-y-[2px]">
                                                        {index + 1}
                                                    </span>
                                                </div>
                                            </div>

                                            <span
                                                className={"text-[20px] leading-relaxed font-medium text-jv-text-black translate-y-[4px] max-md:text-[15px]"}>
                                                {item.label}
                                            </span>
                                        </div>
                                    ))}
                                </div>

                                <div className={"flex flex-col gap-[25px] max-md:gap-[20px]"}>
                                    {features.slice(10, 20).map((item, index) => (
                                        <div key={item.key}
                                            className={"flex items-center gap-[16px]"}>
                                            <div
                                                className={"w-[30px] h-[30px] border border-dashed border-jv-red rounded-full flex items-center justify-center max-md:w-[24px] max-md:h-[24px]"}>
                                                <div
                                                    className={"w-[24px] h-[24px] border border-jv-red rounded-full flex items-center justify-center text-[14px] leading-[15px] text-jv-red max-md:text-[12px] max-md:w-[19px] max-md:h-[19px]"}>
                                                    <span className="translate-y-[2px]">
                                                        {index + 11}
                                                    </span>
                                                </div>
                                            </div>

                                            <span
                                                className={"text-[20px] leading-relaxed font-medium text-jv-text-black translate-y-[4px] max-md:text-[15px]"}>
                                                {item.label}
                                            </span>
                                        </div>
                                    ))}
                                </div>
                            </div>

                            <div className={"mt-[80px] max-md:gap-[20px]"}>
                                <div className={"border-y border-y-[#D2B14A] p-[10px] max-md:px-[10px] max-md:py-[5px]"}>
                                    <div className={"flex items-center justify-between gap-[45px]"}>
                                        <div className={"flex items-center gap-[15px]"}>
                                            <div className={"w-[48px] h-[48px] relative max-md:w-[32px] max-md:h-[32px]"}>
                                                <Image fill src={"/assets/area_coverage_icon.gif"}
                                                    alt={"area-coverage"} />
                                            </div>

                                            <div className={"flex flex-col gap-[5px]"}>
                                                <h3 className={"text-[18px] leading-relaxed text-jv-text-black max-md:text-[15px]"}>
                                                    क्षेत्रफल
                                                </h3>

                                                <span
                                                    className={"text-[20px] leading-relaxed font-bold text-jv-text-black max-md:text-[16px]"}>
                                                    ७१ रोपनी
                                                </span>
                                            </div>
                                        </div>

                                        <div className={"flex items-center gap-[15px]"}>
                                            <div className={"w-[48px] h-[48px] relative max-md:w-[32px] max-md:h-[32px]"}>
                                                <Image fill src={"/assets/altitude_icon.gif"} alt={"area-coverage"} />
                                            </div>

                                            <div className={"flex flex-col gap-[5px]"}>
                                                <h3 className={"text-[18px] leading-relaxed text-jv-text-black max-md:text-[15px]"}>
                                                    समुद्र सतहबाट उचाइ
                                                </h3>

                                                <span
                                                    className={"text-[20px] leading-relaxed font-bold text-jv-text-black max-md:text-[16px]"}>
                                                    १५०० मिटर
                                                </span>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </div>

                            <div className={"mt-[30px]"}>
                                {/* <Button type={"primary"}
                                        icon={(
                                            <svg width="24" height="24" className={"w-[24px] h-[24px]"} viewBox="0 0 24 24"
                                                fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M10.6599 8.68263C10.5592 8.68618 10.4589 8.66943 10.3648 8.63336C10.2708 8.59729 10.185 8.54265 10.1125 8.4727C10.0401 8.40275 9.98243 8.31892 9.94307 8.22621C9.90371 8.1335 9.88342 8.03382 9.88342 7.9331C9.88342 7.83238 9.90371 7.73269 9.94307 7.63999C9.98243 7.54728 10.0401 7.46345 10.1125 7.3935C10.185 7.32354 10.2708 7.26891 10.3648 7.23284C10.4589 7.19677 10.5592 7.18001 10.6599 7.18357L16.3167 7.18357C16.5155 7.18369 16.7061 7.2627 16.8466 7.40324C16.9871 7.54377 17.0661 7.73435 17.0663 7.9331L17.0663 13.59C17.0698 13.6906 17.0531 13.791 17.017 13.885C16.9809 13.979 16.9263 14.0648 16.8563 14.1373C16.7864 14.2098 16.7026 14.2674 16.6098 14.3068C16.5171 14.3461 16.4174 14.3664 16.3167 14.3664C16.216 14.3664 16.1163 14.3461 16.0236 14.3068C15.9309 14.2674 15.8471 14.2098 15.7771 14.1373C15.7072 14.0648 15.6525 13.979 15.6165 13.885C15.5804 13.791 15.5636 13.6906 15.5672 13.59L15.5672 9.74329L8.71533 16.5952C8.57468 16.7358 8.38391 16.8148 8.185 16.8148C7.98609 16.8148 7.79532 16.7358 7.65467 16.5952C7.51402 16.4545 7.435 16.2637 7.435 16.0648C7.435 15.8659 7.51402 15.6751 7.65467 15.5345L14.5065 8.68263L10.6599 8.68263Z"
                                                    fill="white" />
                                            </svg>
                                        )}
                                        iconPosition={"end"}>
                                        Explore 3d tour
                                    </Button> */}
                            </div>
                        </div>

                        <div className="basis-[45vw] grow-0 h-[750px] relative max-md:basis-[100vw] max-md:h-[415px] max-md:grow max-md:shrink max-md:w-screen">
                            <Image fill alt="dham model" src={"/assets/dham_model.png"} />
                        </div>
                    </div>
                </section>

                <section className="px-[150px] pt-[62px] pb-[38px] bg-[url('/assets/dham_bg.png')] bg-cover bg-no-repeat max-xl:px-[5%] max-md:p-[20px]">
                    <div className="flex items-center justify-center flex-col gap-[20px] max-md:gap-[12px]">
                        <svg width="40" height="24" className="w-[40px] h-[24px] max-md:w-[24px] max-md:h-[14px]" viewBox="0 0 40 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M18.4667 1.05122C17.5452 2.17497 15.6799 5.00682 15.4327 5.63612C15.3428 5.90582 15.6125 6.19799 16.3541 6.69244C17.3655 7.34422 18.9162 8.78261 19.6578 9.77151C19.9725 10.1761 20.0174 10.1985 20.2197 9.83894C20.7591 8.93994 21.703 7.99599 23.0515 7.05204C23.8381 6.49017 24.4898 5.88334 24.4898 5.72602C24.4898 5.34394 22.0401 1.65805 21.1636 0.714099C20.1747 -0.31975 19.5679 -0.252324 18.4667 1.05122Z" fill="#B8282E" />
                            <path d="M11.6584 1.65842C11.0516 1.95059 10.8043 3.18671 11.2538 3.72611C11.5685 4.10819 12.827 4.15314 13.2091 3.77106C13.5687 3.41146 13.5462 2.13039 13.2091 1.86069C12.6697 1.45614 12.1977 1.38872 11.6584 1.65842Z" fill="#B8282E" />
                            <path d="M27.2338 1.59124C25.8629 2.10817 26.2225 4.04102 27.7058 4.04102C28.6272 4.04102 28.9868 3.70389 28.9868 2.78242C28.9868 1.77104 28.2002 1.23164 27.2338 1.59124Z" fill="#B8282E" />
                            <path d="M4.82767 6.15283C4.46808 6.40005 4.44561 6.66975 4.55798 8.243C4.69282 10.1084 5.25468 12.9178 5.5918 13.4347C5.74912 13.6819 6.01881 13.6819 7.165 13.4572C7.90666 13.3223 9.30007 13.2549 10.244 13.2999L11.9296 13.4122L11.7947 11.8165C11.7273 10.7827 11.7722 9.70387 11.997 8.75992C12.1543 7.95083 12.2667 7.23163 12.2217 7.14173C12.0644 6.91698 8.33367 6.13035 6.71552 5.97303C5.65922 5.9056 5.09736 5.95055 4.82767 6.15283Z" fill="#B8282E" />
                            <path d="M32.3592 6.08605C31.4377 6.19842 30.0219 6.46812 29.2128 6.69287L27.752 7.09742L27.8643 7.86157C27.9317 8.2886 27.9767 9.70452 27.9767 11.0081V13.3679H30.2241C31.4602 13.3679 32.8986 13.4578 33.4155 13.5477L34.3369 13.7275L34.7864 11.7497C35.0561 10.6709 35.3258 9.05275 35.4157 8.17622C35.5281 6.8502 35.4831 6.53555 35.1685 6.2209C34.9662 6.01862 34.6291 5.8613 34.4268 5.8613C34.2246 5.88377 33.2806 5.97367 32.3592 6.08605Z" fill="#B8282E" />
                            <path d="M14.2891 8.80552C14.2217 9.0977 14.1543 10.0866 14.1543 11.0081C14.1543 12.8735 14.7611 14.5142 15.75 15.4132C16.3118 15.9301 17.7727 16.8516 17.9974 16.8516C18.3345 16.8516 18.6941 14.7389 18.5817 13.5702C18.4244 12.0194 17.6603 10.6934 16.1545 9.34492C14.8735 8.17622 14.4914 8.08632 14.2891 8.80552Z" fill="#B8282E" />
                            <path d="M24.0656 9.09692C22.9194 10.0184 21.9755 11.2545 21.5934 12.3333C21.2788 13.2997 21.2788 15.2101 21.5934 16.1316C21.8181 16.7609 21.8856 16.8058 22.4474 16.6036C23.3015 16.3114 24.7848 14.8505 25.2792 13.7942C25.9759 12.3333 26.0209 8.31029 25.3241 8.31029C25.1668 8.31029 24.605 8.66989 24.0656 9.09692Z" fill="#B8282E" />
                            <path d="M0.377666 12.7613C-0.453885 13.6603 0.175397 15.0537 1.41149 15.0537C2.04077 15.0537 2.69252 14.3345 2.69252 13.6603C2.69252 13.0984 1.88345 12.3567 1.27664 12.3567C0.984473 12.3567 0.579935 12.5365 0.377666 12.7613Z" fill="#B8282E" />
                            <path d="M37.6843 12.7613C36.8528 13.6603 37.482 15.0537 38.7181 15.0537C39.3474 15.0537 39.9992 14.3345 39.9992 13.6603C39.9992 13.0984 39.1901 12.3567 38.5833 12.3567C38.2911 12.3567 37.8866 12.5365 37.6843 12.7613Z" fill="#B8282E" />
                            <path d="M8.19637 15.615C8.08399 15.6599 7.70193 15.7498 7.34234 15.8172C6.78048 15.9521 6.75801 16.0195 6.98275 16.4465C7.38729 17.2107 9.25266 19.0986 9.92689 19.4582C11.0057 20.0201 12.7137 20.2448 13.9273 19.9751C14.5566 19.8403 15.096 19.638 15.1859 19.5256C15.3882 19.1885 14.2195 17.368 13.3655 16.7162C12.1519 15.7948 9.40998 15.2104 8.19637 15.615Z" fill="#B8282E" />
                            <path d="M28.1345 15.9073C26.831 16.3793 25.6623 17.3682 25.033 18.5593C24.5161 19.5033 24.7184 19.7505 26.1792 20.0202C28.6289 20.4697 31.0112 19.2785 32.7642 16.7164C33.2137 16.0421 33.2362 15.9972 32.8541 15.8399C31.8652 15.4578 29.3256 15.4803 28.1345 15.9073Z" fill="#B8282E" />
                            <path d="M18.7163 19.8856C18.0421 20.3575 17.8398 21.5487 18.2893 22.4252C19.368 24.4929 22.6268 22.9646 21.7953 20.7846C21.6604 20.425 21.3907 20.0204 21.166 19.8631C20.6491 19.4585 19.3006 19.481 18.7163 19.8856Z" fill="#B8282E" />
                        </svg>

                        <h2 className="text-[36px] max-md:text-[20px] leading-relaxed font-semibold text-jv-text-black text-center">
                            धामबाट कसले लाभ लिन सक्नेछन् ?
                        </h2>
                    </div>

                    <div className="mt-[60px] max-md:mt-[20px]">
                        <div className="relative flex justify-between max-md:hidden">
                            <div className="absolute left-1/2 top-1/2 -translate-x-1/2 -translate-y-1/2 z-0">
                                <div className="min-w-[444px] w-[444px] h-[444px] relative animate-[spin_60s_linear_infinite]">
                                    <Image fill src={"/assets/goal_mandala.png"} alt="meditation" />
                                </div>
                            </div>

                            <ul className="flex flex-col gap-y-12 basis-[400px] grow-0">
                                {left.map((item, i) => (
                                    <BenefitCard key={i} label={item} index={i + 1} />
                                ))}
                            </ul>

                            <div className="w-[240px] h-[270px] relative">
                                <Image fill alt="mediation" src={"/assets/meditation.png"} />
                            </div>

                            <ul className="flex flex-col gap-y-12 basis-[400px] grow-0">
                                {right.map((item, i) => (
                                    /* start numbering at 4 on the right side */
                                    <BenefitCard key={i} label={item} index={i + 4} />
                                ))}
                            </ul>
                        </div>

                        <div className="hidden max-md:flex max-md:flex-col">
                            <div className="flex flex-col gap-[15px]">
                                {[...left, ...right].map((item, i) => (
                                    <BenefitCard key={i} label={item} index={i + 1} />
                                ))}
                            </div>

                            <div className="w-[95vw] h-[95vw] relative">
                                <div className="w-full h-full relative">
                                    <Image
                                        fill
                                        alt="chakra"
                                        src={"/assets/goal_mandala.png"}
                                        className="object-cover animate-[spin_60s_linear_infinite]" />
                                </div>

                                <div className="absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 w-[50%] h-[55%]">
                                    <div className="w-full h-full relative">
                                        <Image fill alt="mediation" src={"/assets/meditation.png"} />
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>

                    <div className="mt-[90px] max-md:mt-[15px]">
                        <div className="flex gap-[68px] max-md:flex-col-reverse">
                            <div className="basis-[29vw] grow-0 shrink-0 max-md:basis-[60vw] max-md:w-[60vw] max-md:mx-auto">
                                <div className="w-full h-[29vw] max-md:h-[60vw] bg-[url('/assets/octa_chakra.svg')] bg-cover flex items-center justify-center">
                                    <div className="w-[64px] h-[64px] max-md:w-[13vw] max-md:h-[13vw] relative">
                                        <Image fill src={"/assets/gifs/octa_soul.gif"} alt="octa-chakra"></Image>
                                    </div>
                                </div>
                            </div>

                            <div className="flex-1">
                                <div className="flex flex-col gap-[26px] max-md:gap-[20px]">
                                    <div className="flex flex-col gap-[30px] max-md:gap-[12px]">
                                        <h2 className="text-[36px] leading-relaxed font-semibold text-jv-text-black max-md:text-[20px]">
                                            ध्यान कक्षको संरचना र विशेषता
                                        </h2>

                                        <p className="text-[20px] leading-relaxed text-jv-text-black max-md:text-[15px]">
                                            नेपाली वास्तुकलामा आधारित अष्टकोणीय ध्यानकक्षले सकारात्मक ऊर्जा प्रवाहित गरी प्रवेश गर्ने सबैलाई दिव्यानुभूति गराउनेछ। पूर्णता र आठौँ चक्रको प्रतीक यस कक्षले साधकलाई गहन ध्यान र परम शान्तिको अनुभूति दिनेछ। विशेष विधिहरूबाट ब्रह्माण्डीय ऊर्जा आह्वान गरी पवित्र र ध्यानमय विराट् ऊर्जा मण्डल तयार गरिएको छ।
                                        </p>
                                    </div>

                                    <ImageCarousel />
                                </div>
                            </div>
                        </div>
                    </div>
                </section>

                <section className="px-[150px] pt-[62px] pb-[76px] max-xl:px-[5%] max-md:p-[20px]">
                    <div className="flex flex-col gap-[38px] max-md:gap-[9px]">
                        <div className="flex items-center justify-center flex-col gap-[20px] max-md:gap-[12px]">
                            <svg width="41" height="24" className="w-[41px] h-[24px] max-md:w-[24px] max-md:h-[12px]" viewBox="0 0 41 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M18.9667 1.05122C18.0452 2.17497 16.1799 5.00682 15.9327 5.63612C15.8428 5.90582 16.1125 6.19799 16.8541 6.69244C17.8655 7.34422 19.4162 8.78261 20.1578 9.77151C20.4725 10.1761 20.5174 10.1985 20.7197 9.83894C21.2591 8.93994 22.203 7.99599 23.5515 7.05204C24.3381 6.49017 24.9898 5.88334 24.9898 5.72602C24.9898 5.34394 22.5401 1.65805 21.6636 0.714099C20.6747 -0.31975 20.0679 -0.252324 18.9667 1.05122Z" fill="#B8282E" />
                                <path d="M12.1584 1.65842C11.5516 1.95059 11.3043 3.18671 11.7538 3.72611C12.0685 4.10819 13.327 4.15314 13.7091 3.77106C14.0687 3.41146 14.0462 2.13039 13.7091 1.86069C13.1697 1.45614 12.6977 1.38872 12.1584 1.65842Z" fill="#B8282E" />
                                <path d="M27.7338 1.59124C26.3629 2.10817 26.7225 4.04102 28.2058 4.04102C29.1272 4.04102 29.4868 3.70389 29.4868 2.78242C29.4868 1.77104 28.7002 1.23164 27.7338 1.59124Z" fill="#B8282E" />
                                <path d="M5.32767 6.15283C4.96808 6.40005 4.94561 6.66975 5.05798 8.243C5.19282 10.1084 5.75468 12.9178 6.0918 13.4347C6.24912 13.6819 6.51881 13.6819 7.665 13.4572C8.40666 13.3223 9.80007 13.2549 10.744 13.2999L12.4296 13.4122L12.2947 11.8165C12.2273 10.7827 12.2722 9.70387 12.497 8.75992C12.6543 7.95083 12.7667 7.23163 12.7217 7.14173C12.5644 6.91698 8.83367 6.13035 7.21552 5.97303C6.15922 5.9056 5.59736 5.95055 5.32767 6.15283Z" fill="#B8282E" />
                                <path d="M32.8592 6.08605C31.9377 6.19842 30.5219 6.46812 29.7128 6.69287L28.252 7.09742L28.3643 7.86157C28.4317 8.2886 28.4767 9.70452 28.4767 11.0081V13.3679H30.7241C31.9602 13.3679 33.3986 13.4578 33.9155 13.5477L34.8369 13.7275L35.2864 11.7497C35.5561 10.6709 35.8258 9.05275 35.9157 8.17622C36.0281 6.8502 35.9831 6.53555 35.6685 6.2209C35.4662 6.01862 35.1291 5.8613 34.9268 5.8613C34.7246 5.88377 33.7806 5.97367 32.8592 6.08605Z" fill="#B8282E" />
                                <path d="M14.7891 8.80552C14.7217 9.0977 14.6543 10.0866 14.6543 11.0081C14.6543 12.8735 15.2611 14.5142 16.25 15.4132C16.8118 15.9301 18.2727 16.8516 18.4974 16.8516C18.8345 16.8516 19.1941 14.7389 19.0817 13.5702C18.9244 12.0194 18.1603 10.6934 16.6545 9.34492C15.3735 8.17622 14.9914 8.08632 14.7891 8.80552Z" fill="#B8282E" />
                                <path d="M24.5656 9.09692C23.4194 10.0184 22.4755 11.2545 22.0934 12.3333C21.7788 13.2997 21.7788 15.2101 22.0934 16.1316C22.3181 16.7609 22.3856 16.8058 22.9474 16.6036C23.8015 16.3114 25.2848 14.8505 25.7792 13.7942C26.4759 12.3333 26.5209 8.31029 25.8241 8.31029C25.6668 8.31029 25.105 8.66989 24.5656 9.09692Z" fill="#B8282E" />
                                <path d="M0.877666 12.7613C0.0461147 13.6603 0.675397 15.0537 1.91149 15.0537C2.54077 15.0537 3.19252 14.3345 3.19252 13.6603C3.19252 13.0984 2.38345 12.3567 1.77664 12.3567C1.48447 12.3567 1.07994 12.5365 0.877666 12.7613Z" fill="#B8282E" />
                                <path d="M38.1843 12.7613C37.3528 13.6603 37.982 15.0537 39.2181 15.0537C39.8474 15.0537 40.4992 14.3345 40.4992 13.6603C40.4992 13.0984 39.6901 12.3567 39.0833 12.3567C38.7911 12.3567 38.3866 12.5365 38.1843 12.7613Z" fill="#B8282E" />
                                <path d="M8.69637 15.615C8.58399 15.6599 8.20193 15.7498 7.84234 15.8172C7.28048 15.9521 7.25801 16.0195 7.48275 16.4465C7.88729 17.2107 9.75266 19.0986 10.4269 19.4582C11.5057 20.0201 13.2137 20.2448 14.4273 19.9751C15.0566 19.8403 15.596 19.638 15.6859 19.5256C15.8882 19.1885 14.7195 17.368 13.8655 16.7162C12.6519 15.7948 9.90998 15.2104 8.69637 15.615Z" fill="#B8282E" />
                                <path d="M28.6345 15.9073C27.331 16.3793 26.1623 17.3682 25.533 18.5593C25.0161 19.5033 25.2184 19.7505 26.6792 20.0202C29.1289 20.4697 31.5112 19.2785 33.2642 16.7164C33.7137 16.0421 33.7362 15.9972 33.3541 15.8399C32.3652 15.4578 29.8256 15.4803 28.6345 15.9073Z" fill="#B8282E" />
                                <path d="M19.2163 19.8856C18.5421 20.3575 18.3398 21.5487 18.7893 22.4252C19.868 24.4929 23.1268 22.9646 22.2953 20.7846C22.1604 20.425 21.8907 20.0204 21.666 19.8631C21.1491 19.4585 19.8006 19.481 19.2163 19.8856Z" fill="#B8282E" />
                            </svg>

                            <h2 className="text-[36px] leading-relaxed max-md:text-[20px] font-semibold text-jv-text-black">
                                जीवन विज्ञान धाम सम्बन्धी तस्वीरहरू
                            </h2>
                        </div>

                        <ImageGrid />
                    </div>
                </section>

                <section className="px-[150px] pt-[62px] pb-[67px] flex gap-[46px] bg-[url('/assets/number_counter_bg.png')] bg-cover bg-no-repeat bg-center z-[1] max-xl:px-[5%] max-md:p-[20px] max-md:pb-0 max-md:flex-col">
                    <div className="flex flex-col gap-[36px] flex-1 max-md:gap-[20px]">
                        <div className="flex flex-col gap-[20px] max-md:gap-[12px]">
                            <svg width="40" height="24" className="w-[40px] h-[24px] max-md:w-[24px] max-md:h-[14px]" viewBox="0 0 40 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M18.4667 1.05122C17.5452 2.17497 15.6799 5.00682 15.4327 5.63612C15.3428 5.90582 15.6125 6.19799 16.3541 6.69244C17.3655 7.34422 18.9162 8.78261 19.6578 9.77151C19.9725 10.1761 20.0174 10.1985 20.2197 9.83894C20.7591 8.93994 21.703 7.99599 23.0515 7.05204C23.8381 6.49017 24.4898 5.88334 24.4898 5.72602C24.4898 5.34394 22.0401 1.65805 21.1636 0.714099C20.1747 -0.31975 19.5679 -0.252324 18.4667 1.05122Z" fill="#B8282E" />
                                <path d="M11.6584 1.65842C11.0516 1.95059 10.8043 3.18671 11.2538 3.72611C11.5685 4.10819 12.827 4.15314 13.2091 3.77106C13.5687 3.41146 13.5462 2.13039 13.2091 1.86069C12.6697 1.45614 12.1977 1.38872 11.6584 1.65842Z" fill="#B8282E" />
                                <path d="M27.2338 1.59124C25.8629 2.10817 26.2225 4.04102 27.7058 4.04102C28.6272 4.04102 28.9868 3.70389 28.9868 2.78242C28.9868 1.77104 28.2002 1.23164 27.2338 1.59124Z" fill="#B8282E" />
                                <path d="M4.82767 6.15283C4.46808 6.40005 4.44561 6.66975 4.55798 8.243C4.69282 10.1084 5.25468 12.9178 5.5918 13.4347C5.74912 13.6819 6.01881 13.6819 7.165 13.4572C7.90666 13.3223 9.30007 13.2549 10.244 13.2999L11.9296 13.4122L11.7947 11.8165C11.7273 10.7827 11.7722 9.70387 11.997 8.75992C12.1543 7.95083 12.2667 7.23163 12.2217 7.14173C12.0644 6.91698 8.33367 6.13035 6.71552 5.97303C5.65922 5.9056 5.09736 5.95055 4.82767 6.15283Z" fill="#B8282E" />
                                <path d="M32.3592 6.08605C31.4377 6.19842 30.0219 6.46812 29.2128 6.69287L27.752 7.09742L27.8643 7.86157C27.9317 8.2886 27.9767 9.70452 27.9767 11.0081V13.3679H30.2241C31.4602 13.3679 32.8986 13.4578 33.4155 13.5477L34.3369 13.7275L34.7864 11.7497C35.0561 10.6709 35.3258 9.05275 35.4157 8.17622C35.5281 6.8502 35.4831 6.53555 35.1685 6.2209C34.9662 6.01862 34.6291 5.8613 34.4268 5.8613C34.2246 5.88377 33.2806 5.97367 32.3592 6.08605Z" fill="#B8282E" />
                                <path d="M14.2891 8.80552C14.2217 9.0977 14.1543 10.0866 14.1543 11.0081C14.1543 12.8735 14.7611 14.5142 15.75 15.4132C16.3118 15.9301 17.7727 16.8516 17.9974 16.8516C18.3345 16.8516 18.6941 14.7389 18.5817 13.5702C18.4244 12.0194 17.6603 10.6934 16.1545 9.34492C14.8735 8.17622 14.4914 8.08632 14.2891 8.80552Z" fill="#B8282E" />
                                <path d="M24.0656 9.09692C22.9194 10.0184 21.9755 11.2545 21.5934 12.3333C21.2788 13.2997 21.2788 15.2101 21.5934 16.1316C21.8181 16.7609 21.8856 16.8058 22.4474 16.6036C23.3015 16.3114 24.7848 14.8505 25.2792 13.7942C25.9759 12.3333 26.0209 8.31029 25.3241 8.31029C25.1668 8.31029 24.605 8.66989 24.0656 9.09692Z" fill="#B8282E" />
                                <path d="M0.377666 12.7613C-0.453885 13.6603 0.175397 15.0537 1.41149 15.0537C2.04077 15.0537 2.69252 14.3345 2.69252 13.6603C2.69252 13.0984 1.88345 12.3567 1.27664 12.3567C0.984473 12.3567 0.579935 12.5365 0.377666 12.7613Z" fill="#B8282E" />
                                <path d="M37.6843 12.7613C36.8528 13.6603 37.482 15.0537 38.7181 15.0537C39.3474 15.0537 39.9992 14.3345 39.9992 13.6603C39.9992 13.0984 39.1901 12.3567 38.5833 12.3567C38.2911 12.3567 37.8866 12.5365 37.6843 12.7613Z" fill="#B8282E" />
                                <path d="M8.19637 15.615C8.08399 15.6599 7.70193 15.7498 7.34234 15.8172C6.78048 15.9521 6.75801 16.0195 6.98275 16.4465C7.38729 17.2107 9.25266 19.0986 9.92689 19.4582C11.0057 20.0201 12.7137 20.2448 13.9273 19.9751C14.5566 19.8403 15.096 19.638 15.1859 19.5256C15.3882 19.1885 14.2195 17.368 13.3655 16.7162C12.1519 15.7948 9.40998 15.2104 8.19637 15.615Z" fill="#B8282E" />
                                <path d="M28.1345 15.9073C26.831 16.3793 25.6623 17.3682 25.033 18.5593C24.5161 19.5033 24.7184 19.7505 26.1792 20.0202C28.6289 20.4697 31.0112 19.2785 32.7642 16.7164C33.2137 16.0421 33.2362 15.9972 32.8541 15.8399C31.8652 15.4578 29.3256 15.4803 28.1345 15.9073Z" fill="#B8282E" />
                                <path d="M18.7163 19.8856C18.0421 20.3575 17.8398 21.5487 18.2893 22.4252C19.368 24.4929 22.6268 22.9646 21.7953 20.7846C21.6604 20.425 21.3907 20.0204 21.166 19.8631C20.6491 19.4585 19.3006 19.481 18.7163 19.8856Z" fill="#B8282E" />
                            </svg>

                            <h2 className="text-[36px] max-md:text-[20px] leading-relaxed font-semibold text-jv-text-black">
                                धाम निर्माण स्थल
                            </h2>
                        </div>

                        <ul className="list-disc pl-[30px] max-md:pl-[20px]">
                            {locationDetails.map(item => (
                                <li key={item.key}
                                    className="text-[20px] leading-[44px] max-md:text-[15px] max-md:leading-[30px] text-jv-text-black">
                                    {item.label}
                                </li>
                            ))}
                        </ul>
                    </div>

                    <div className="basis-[42vw] grow-0 shrink-0 mt-[40px] h-[400px] max-md:basis-[100vw] max-md:w-screen max-md:mt-0 max-md:h-[220px] max-md:-mx-[20px]">
                        <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d10127.298521366756!2d85.09634254345805!3d27.740551416395288!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39eb2ff9c58be427%3A0xceba19bd328b07d6!2zSmVldmFuIFZpZ3lhbiBEaGFtICjgpJzgpYDgpLXgpKgg4KS14KS_4KSc4KWN4KSe4KS-4KSoIOCkp-CkvuCkrik!5e0!3m2!1sen!2snp!4v1752661113547!5m2!1sen!2snp" width="100%" height="100%" allowFullScreen={false} loading="lazy" referrerPolicy="no-referrer-when-downgrade"></iframe>
                    </div>
                </section>
            </section>
        </section>
    )
}

const BenefitCard = ({ label, index }) => (
    <article className={`flex items-center gap-[20px] max-md:gap-[10px] ${index <= 3 ? 'pr-[20px] max-md:p-0 max-md:flex-row-reverse max-md:justify-end' : 'flex-row-reverse justify-end'}`}>
        <p className="text-[20px] leading-relaxed text-jv-text-black max-md:text-[15px]">
            {label}
        </p>

        <div className="flex items-center justify-center min-w-[62px] w-[62px] h-[62px] relative bg-[url('/assets/benefit_index_icon.png')] bg-cover max-md:min-w-[42px] max-md:w-[42px] max-md:h-[42px]">
            <span className="text-[20px] leading-relaxed font-medium text-jv-red translate-y-0.5 max-md:text-[12px]">
                {index}
            </span>
        </div>
    </article>
)
