'use client';
import { Button } from "antd";
import Image from "next/image";
import Link from "next/link";

const contribution = [
    {
        key: 1,
        icon: '/assets/gifs/charity.gif',
        title: 'आर्थिक योगदान',
        label: 'धामको दीर्घकालीन सञ्चालन र संरचना निर्माणमा तपाईंको आर्थिक सहयोग महत्वपूर्ण योगदान बन्न सक्छ।'
    },
    {
        key: 2,
        icon: '/assets/gifs/house.gif',
        title: 'वस्तुगत योगदान',
        label: 'तपाईंले व्यक्तिगत वा पारिवारिक रूपमा पार्क, ध्यानकक्ष, आवास आदि भौतिक संरचना निर्माण गरेर प्रतिष्ठानलाई हस्तान्तरण गर्न सक्नुहुन्छ।'
    },
    {
        key: 3,
        icon: '/assets/gifs/high-five.gif',
        title: 'श्रमदान',
        label: 'आफ्ना सीप र क्षमतामार्फत सेवा प्रदान गरी आत्मिक सन्तुष्टि र पुण्यको अनुभूति प्राप्त गर्नुहोस्।'
    }
]

const contactDetails = {
    phoneNumber: ['01-4572830', '9851332863', '9851332963'],
    mail: 'info@jeevanvigyan.org',
    location: 'Ganesh Marga ( Near Ganesh Temple ), Chabahil, Kathmandu'
}

const Footer = ({ showFullSection = true }) => {
    return (
        <footer
            className="relative before::content-none before:absolute before:top-0 before:left-0 before:w-full before:h-full before:opacity-[0.5] before:bg-[url('/assets/footer_bg.png')] before:bg-cover before:bg-center before:bg-no-repeat">
            {/* participation section */}
            {
                showFullSection &&
                <>
                    <section className="px-[150px] max-xl:px-[5%] max-md:px-[20px] pt-[60px] pb-[100px] relative">
                        <div className="absolute bottom-0 left-1/2 -translate-x-1/2">
                            <div className="w-[358px] h-[226px] relative">
                                <Image fill alt="lotus" src={'/assets/lotus.png'} />
                            </div>
                        </div>

                        <div className="flex flex-col gap-[20px] items-center justify-center">
                            <svg width="40" height="24" className="w-[40px] h-[24px]" viewBox="0 0 40 24" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M18.4667 1.05122C17.5452 2.17497 15.6799 5.00682 15.4327 5.63612C15.3428 5.90582 15.6125 6.19799 16.3541 6.69244C17.3655 7.34422 18.9162 8.78261 19.6578 9.77151C19.9725 10.1761 20.0174 10.1985 20.2197 9.83894C20.7591 8.93994 21.703 7.99599 23.0515 7.05204C23.8381 6.49017 24.4898 5.88334 24.4898 5.72602C24.4898 5.34394 22.0401 1.65805 21.1636 0.714099C20.1747 -0.31975 19.5679 -0.252324 18.4667 1.05122Z"
                                    fill="#B8282E" />
                                <path
                                    d="M11.6584 1.65842C11.0516 1.95059 10.8043 3.18671 11.2538 3.72611C11.5685 4.10819 12.827 4.15314 13.2091 3.77106C13.5687 3.41146 13.5462 2.13039 13.2091 1.86069C12.6697 1.45614 12.1977 1.38872 11.6584 1.65842Z"
                                    fill="#B8282E" />
                                <path
                                    d="M27.2338 1.59124C25.8629 2.10817 26.2225 4.04102 27.7058 4.04102C28.6272 4.04102 28.9868 3.70389 28.9868 2.78242C28.9868 1.77104 28.2002 1.23164 27.2338 1.59124Z"
                                    fill="#B8282E" />
                                <path
                                    d="M4.82767 6.15283C4.46808 6.40005 4.44561 6.66975 4.55798 8.243C4.69282 10.1084 5.25468 12.9178 5.5918 13.4347C5.74912 13.6819 6.01881 13.6819 7.165 13.4572C7.90666 13.3223 9.30007 13.2549 10.244 13.2999L11.9296 13.4122L11.7947 11.8165C11.7273 10.7827 11.7722 9.70387 11.997 8.75992C12.1543 7.95083 12.2667 7.23163 12.2217 7.14173C12.0644 6.91698 8.33367 6.13035 6.71552 5.97303C5.65922 5.9056 5.09736 5.95055 4.82767 6.15283Z"
                                    fill="#B8282E" />
                                <path
                                    d="M32.3592 6.08605C31.4377 6.19842 30.0219 6.46812 29.2128 6.69287L27.752 7.09742L27.8643 7.86157C27.9317 8.2886 27.9767 9.70452 27.9767 11.0081V13.3679H30.2241C31.4602 13.3679 32.8986 13.4578 33.4155 13.5477L34.3369 13.7275L34.7864 11.7497C35.0561 10.6709 35.3258 9.05275 35.4157 8.17622C35.5281 6.8502 35.4831 6.53555 35.1685 6.2209C34.9662 6.01862 34.6291 5.8613 34.4268 5.8613C34.2246 5.88377 33.2806 5.97367 32.3592 6.08605Z"
                                    fill="#B8282E" />
                                <path
                                    d="M14.2891 8.80552C14.2217 9.0977 14.1543 10.0866 14.1543 11.0081C14.1543 12.8735 14.7611 14.5142 15.75 15.4132C16.3118 15.9301 17.7727 16.8516 17.9974 16.8516C18.3345 16.8516 18.6941 14.7389 18.5817 13.5702C18.4244 12.0194 17.6603 10.6934 16.1545 9.34492C14.8735 8.17622 14.4914 8.08632 14.2891 8.80552Z"
                                    fill="#B8282E" />
                                <path
                                    d="M24.0656 9.09692C22.9194 10.0184 21.9755 11.2545 21.5934 12.3333C21.2788 13.2997 21.2788 15.2101 21.5934 16.1316C21.8181 16.7609 21.8856 16.8058 22.4474 16.6036C23.3015 16.3114 24.7848 14.8505 25.2792 13.7942C25.9759 12.3333 26.0209 8.31029 25.3241 8.31029C25.1668 8.31029 24.605 8.66989 24.0656 9.09692Z"
                                    fill="#B8282E" />
                                <path
                                    d="M0.377666 12.7613C-0.453885 13.6603 0.175397 15.0537 1.41149 15.0537C2.04077 15.0537 2.69252 14.3345 2.69252 13.6603C2.69252 13.0984 1.88345 12.3567 1.27664 12.3567C0.984473 12.3567 0.579935 12.5365 0.377666 12.7613Z"
                                    fill="#B8282E" />
                                <path
                                    d="M37.6843 12.7613C36.8528 13.6603 37.482 15.0537 38.7181 15.0537C39.3474 15.0537 39.9992 14.3345 39.9992 13.6603C39.9992 13.0984 39.1901 12.3567 38.5833 12.3567C38.2911 12.3567 37.8866 12.5365 37.6843 12.7613Z"
                                    fill="#B8282E" />
                                <path
                                    d="M8.19637 15.615C8.08399 15.6599 7.70193 15.7498 7.34234 15.8172C6.78048 15.9521 6.75801 16.0195 6.98275 16.4465C7.38729 17.2107 9.25266 19.0986 9.92689 19.4582C11.0057 20.0201 12.7137 20.2448 13.9273 19.9751C14.5566 19.8403 15.096 19.638 15.1859 19.5256C15.3882 19.1885 14.2195 17.368 13.3655 16.7162C12.1519 15.7948 9.40998 15.2104 8.19637 15.615Z"
                                    fill="#B8282E" />
                                <path
                                    d="M28.1345 15.9073C26.831 16.3793 25.6623 17.3682 25.033 18.5593C24.5161 19.5033 24.7184 19.7505 26.1792 20.0202C28.6289 20.4697 31.0112 19.2785 32.7642 16.7164C33.2137 16.0421 33.2362 15.9972 32.8541 15.8399C31.8652 15.4578 29.3256 15.4803 28.1345 15.9073Z"
                                    fill="#B8282E" />
                                <path
                                    d="M18.7163 19.8856C18.0421 20.3575 17.8398 21.5487 18.2893 22.4252C19.368 24.4929 22.6268 22.9646 21.7953 20.7846C21.6604 20.425 21.3907 20.0204 21.166 19.8631C20.6491 19.4585 19.3006 19.481 18.7163 19.8856Z"
                                    fill="#B8282E" />
                            </svg>

                            <h2 className="text-[36px] leading-relaxed font-semibold text-jv-text-black text-center">
                                कसरी सहभागिता जनाउने ?
                            </h2>
                        </div>

                        <div className="mt-[22px] w-[85%]">
                            <p className="text-[20px] leading-[36px] text-jv-text-black text-center">
                                जीवन विज्ञान धाममा योगदान गर्ने तीन तरिका छन् — आर्थिक सहयोग, श्रमदान र सीप/विज्ञता
                                अनुसारको सहभागिता। यो योगदान भावी पुस्तालाई समर्पित ऐतिहासिक संरचनामार्फत योग, ध्यान र
                                साधनाको स्थायी केन्द्र बन्नेछ।
                            </p>
                        </div>

                        <div className="mt-[42px]">
                            <div className="w-full grid grid-cols-3 max-sm:grid-cols-1 gap-[40px] max-sm:gap-0 relative text-center">

                                <div
                                    className='col-span-3 absolute max-sm:hidden w-full h-full flex justify-evenly items-center '>
                                    <div
                                        className="w-[10px] h-[10px] bg-[#B8282E] rounded-full"></div>
                                    <div
                                        className="w-[10px] h-[10px] bg-[#B8282E] rounded-full"></div>

                                </div>
                                {contribution.map(item => (
                                    <article key={item.key}
                                        className="py-[20px] px-[26px] max-sm:p-0 gap-[20px] flex items-center justify-center flex-col">
                                        <div className="w-[48px] h-[48px] relative ">
                                            <Image fill
                                                src={item.icon}
                                                alt={item.title} />
                                        </div>

                                        <h2 className="text-[26px] leading-[40px] text-center text-jv-red">
                                            {item.title}
                                        </h2>

                                        <p className="text-[20px] leading-[36px] text-jv-text-black text-center">
                                            {item.label}
                                        </p>
                                    </article>
                                ))}

                            </div>
                        </div>

                        <div className="mt-[30px] flex items-center justify-center">
                            <Button className="!text-jv-red max-md:!text-[14px]"
                                href='/faq'
                                icon={(
                                    <svg width="24" height="24" className="w-[24px] h-[24px]" viewBox="0 0 24 24"
                                        fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M10.6599 8.68263C10.5592 8.68618 10.4589 8.66943 10.3648 8.63336C10.2708 8.59729 10.185 8.54265 10.1125 8.4727C10.0401 8.40275 9.98243 8.31892 9.94307 8.22621C9.90371 8.1335 9.88342 8.03382 9.88342 7.9331C9.88342 7.83238 9.90371 7.73269 9.94307 7.63999C9.98243 7.54728 10.0401 7.46345 10.1125 7.3935C10.185 7.32354 10.2708 7.26891 10.3648 7.23284C10.4589 7.19677 10.5592 7.18001 10.6599 7.18357L16.3167 7.18357C16.5155 7.18369 16.7061 7.2627 16.8466 7.40324C16.9871 7.54377 17.0661 7.73435 17.0663 7.9331L17.0663 13.59C17.0698 13.6906 17.0531 13.791 17.017 13.885C16.9809 13.979 16.9263 14.0648 16.8563 14.1373C16.7864 14.2098 16.7026 14.2674 16.6098 14.3068C16.5171 14.3461 16.4174 14.3664 16.3167 14.3664C16.216 14.3664 16.1163 14.3461 16.0236 14.3068C15.9309 14.2674 15.8471 14.2098 15.7771 14.1373C15.7072 14.0648 15.6525 13.979 15.6165 13.885C15.5804 13.791 15.5636 13.6906 15.5672 13.59L15.5672 9.74329L8.71533 16.5952C8.57468 16.7358 8.38391 16.8148 8.185 16.8148C7.98609 16.8148 7.79532 16.7358 7.65467 16.5952C7.51402 16.4545 7.435 16.2637 7.435 16.0648C7.435 15.8659 7.51402 15.6751 7.65467 15.5345L14.5065 8.68263L10.6599 8.68263Z"
                                            fill="#B8282E" />
                                    </svg>
                                )}
                                iconPosition="end">
                                थप जान्नुहोस्
                            </Button>
                        </div>
                    </section>

                </>
            }
            <section
                className="px-[150px] max-xl:px-[5%] max-md:px-[20px] pt-[21px] pb-[23px] bg-[url('/assets/decorative_bg.png')] relative z-[1]">
                <div className="flex items-center justify-between">
                    <p className="text-[20px] leading-relaxed font-medium text-white w-full text-center">
                        मानव समाजको उन्नति, प्रगति र अभ्युदयका साथ आध्यात्मिक जागरण ल्याउने, हरेकको जीवनलाई
                        मूल्यवान र सार्थक बनाउने तथा लोककल्याणका सत्कृत्यहरू प्रवर्धन गर्ने यस महान अभियानमा
                        तपाईँ पनि सहभागी बन्न सक्नुहुनेछ |
                    </p>

                    <Button className="!text-jv-red !hidden" icon={(
                        <svg width="24" height="24" className="w-[24px] h-[24px]" viewBox="0 0 24 24"
                            fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M10.6599 8.68263C10.5592 8.68618 10.4589 8.66943 10.3648 8.63336C10.2708 8.59729 10.185 8.54265 10.1125 8.4727C10.0401 8.40275 9.98243 8.31892 9.94307 8.22621C9.90371 8.1335 9.88342 8.03382 9.88342 7.9331C9.88342 7.83238 9.90371 7.73269 9.94307 7.63999C9.98243 7.54728 10.0401 7.46345 10.1125 7.3935C10.185 7.32354 10.2708 7.26891 10.3648 7.23284C10.4589 7.19677 10.5592 7.18001 10.6599 7.18357L16.3167 7.18357C16.5155 7.18369 16.7061 7.2627 16.8466 7.40324C16.9871 7.54377 17.0661 7.73435 17.0663 7.9331L17.0663 13.59C17.0698 13.6906 17.0531 13.791 17.017 13.885C16.9809 13.979 16.9263 14.0648 16.8563 14.1373C16.7864 14.2098 16.7026 14.2674 16.6098 14.3068C16.5171 14.3461 16.4174 14.3664 16.3167 14.3664C16.216 14.3664 16.1163 14.3461 16.0236 14.3068C15.9309 14.2674 15.8471 14.2098 15.7771 14.1373C15.7072 14.0648 15.6525 13.979 15.6165 13.885C15.5804 13.791 15.5636 13.6906 15.5672 13.59L15.5672 9.74329L8.71533 16.5952C8.57468 16.7358 8.38391 16.8148 8.185 16.8148C7.98609 16.8148 7.79532 16.7358 7.65467 16.5952C7.51402 16.4545 7.435 16.2637 7.435 16.0648C7.435 15.8659 7.51402 15.6751 7.65467 15.5345L14.5065 8.68263L10.6599 8.68263Z"
                                fill="#B8282E" />
                        </svg>
                    )}
                        iconPosition="end">
                        योगदान गर्नुहोस्
                    </Button>
                </div>
            </section>

            <section className="px-[150px] max-xl:px-[5%] max-md:px-[20px] pt-[0px] pb-[36px] relative">
                <div className='w-full relative'>
                    <div className='w-full absolute flex justify-center'>
                        <img src='/assets/footer.png' className='w-[408px]' />
                    </div>
                </div>
                <div className="w-[128px]  h-[90px] relative mx-auto">
                    <Image className='!top-[40px]' fill alt="Jeevan Vigyan" src={'/assets/jv_logo.png'} />
                </div>


                <div className="mt-[85px]">
                    <div className="flex items-center justify-between max-md:flex-col max-md:items-start max-lg:flex-wrap  max-md:gap-[10px] gap-[68px]">
                        <ContactCard icon={(
                            <svg width="36" height="36" className="w-[36px] h-[36px]" viewBox="0 0 36 36" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0_11617_24712)">
                                    <rect width="36" height="36" rx="18" fill="white" />
                                    <rect x="1.39062" y="0.978027" width="34.7171" height="34.706" rx="17.353"
                                        fill="white" />
                                    <path
                                        d="M24.6125 26.2661H24.5123C12.9324 25.5764 11.2882 15.4561 11.0583 12.3676C11.0398 12.1274 11.0672 11.8858 11.139 11.6567C11.2108 11.4276 11.3255 11.2153 11.4766 11.0322C11.6277 10.849 11.8122 10.6986 12.0195 10.5894C12.2269 10.4802 12.4529 10.4145 12.6848 10.396H15.932C16.168 10.3958 16.3987 10.4689 16.5941 10.6061C16.7896 10.7432 16.9407 10.9379 17.0281 11.1651L17.9238 13.4479C18.0101 13.6698 18.0315 13.9131 17.9854 14.1475C17.9393 14.3819 17.8277 14.5971 17.6645 14.7664L16.4093 16.0787C16.6054 17.2328 17.139 18.2967 17.9379 19.1264C18.7368 19.9561 19.7626 20.5115 20.8763 20.7177L22.1551 19.4053C22.321 19.2382 22.5307 19.1253 22.7581 19.0808C22.9855 19.0363 23.2206 19.0621 23.4339 19.1551L25.6556 20.0768C25.8716 20.1701 26.0559 20.3279 26.185 20.5301C26.314 20.7323 26.3821 20.9697 26.3804 21.2121V24.4349C26.3804 24.9206 26.1942 25.3864 25.8626 25.7298C25.5311 26.0732 25.0814 26.2661 24.6125 26.2661ZM12.8263 11.6168C12.67 11.6168 12.5201 11.6811 12.4096 11.7956C12.2991 11.91 12.237 12.0653 12.237 12.2272V12.276C12.5081 15.8895 14.2465 24.4349 24.5772 25.0453C24.6546 25.0503 24.7322 25.0394 24.8055 25.0132C24.8788 24.987 24.9465 24.9461 25.0045 24.8928C25.0625 24.8395 25.1098 24.7748 25.1437 24.7025C25.1776 24.6303 25.1973 24.5518 25.2018 24.4716V21.2121L22.9801 20.2904L21.2888 22.03L21.0059 21.9934C15.8789 21.3281 15.1835 16.0177 15.1835 15.9627L15.1482 15.6698L16.8218 13.9179L15.9378 11.6168H12.8263Z"
                                        fill="#B8282E" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_11617_24712">
                                        <rect width="36" height="36" rx="18" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        )}>
                            <p className="text-[16px] leading-[24px] text-jv-text-black">
                                Contact Information: <br />
                                <span className="whitespace-nowrap max-md:whitespace-pre-wrap">
                                    {contactDetails.phoneNumber.join(' / ')}
                                </span>
                            </p>
                        </ContactCard>

                        <ContactCard icon={(
                            <svg width="36" height="36" className="w-[36px] h-[36px]" viewBox="0 0 36 36" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <rect width="36" height="36" rx="18" fill="white" />
                                <path
                                    d="M9.4075 9.76904H25.5293C26.289 9.76904 26.9056 10.4604 26.9056 11.3123V23.6587C26.9056 24.068 26.7606 24.4605 26.5025 24.75C26.2444 25.0394 25.8943 25.202 25.5293 25.202H9.4075C9.0425 25.202 8.69244 25.0394 8.43434 24.75C8.17625 24.4605 8.03125 24.068 8.03125 23.6587V11.3123C8.03125 10.4604 8.64781 9.76904 9.4075 9.76904ZM9.21089 13.6599V23.6587C9.21089 23.7804 9.29897 23.8792 9.4075 23.8792H25.5293C25.5814 23.8792 25.6315 23.8559 25.6683 23.8146C25.7052 23.7732 25.7259 23.7172 25.7259 23.6587V13.6599L18.2391 19.3331C17.7735 19.6858 17.1633 19.6858 16.6977 19.3331L9.21089 13.6599ZM9.21089 11.3123V12.0637L17.3583 18.2369C17.3908 18.2615 17.4292 18.2747 17.4684 18.2747C17.5076 18.2747 17.546 18.2615 17.5785 18.2369L25.7259 12.0637V11.3123C25.7259 11.2539 25.7052 11.1978 25.6683 11.1564C25.6315 11.1151 25.5814 11.0919 25.5293 11.0919H9.4075C9.35536 11.0919 9.30535 11.1151 9.26848 11.1564C9.23161 11.1978 9.21089 11.2539 9.21089 11.3123Z"
                                    fill="#B8282E" />
                            </svg>
                        )}>
                            <p className="text-[16px] leading-[24px] text-jv-text-black">
                                Mail us at: <br />
                                {contactDetails.mail}
                            </p>
                        </ContactCard>

                        <ContactCard icon={(
                            <svg width="36" height="36" className="w-[36px] h-[36px]" viewBox="0 0 36 36" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <rect width="36" height="36" rx="18" fill="white" />
                                <path
                                    d="M23.8517 21.7539C25.1358 22.3268 25.9145 23.0783 25.9145 23.9025C25.9145 25.6969 22.22 27.1513 17.6633 27.1513C13.1066 27.1513 9.41211 25.6969 9.41211 23.9025C9.41211 23.0794 10.1908 22.3257 11.4749 21.7539"
                                    stroke="#B8282E" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
                                <path
                                    d="M22.4407 13.8576C22.4407 17.0374 17.6637 22.6538 17.6637 22.6538C17.6637 22.6538 12.8867 17.0374 12.8867 13.8576C12.8867 10.6788 15.0259 8.26074 17.6637 8.26074C20.3016 8.26074 22.4407 10.6788 22.4407 13.8576Z"
                                    stroke="#B8282E" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
                                <path
                                    d="M17.6641 14.5581C18.3837 14.5581 18.967 13.9539 18.967 13.2087C18.967 12.4635 18.3837 11.8594 17.6641 11.8594C16.9446 11.8594 16.3613 12.4635 16.3613 13.2087C16.3613 13.9539 16.9446 14.5581 17.6641 14.5581Z"
                                    stroke="#B8282E" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
                            </svg>
                        )}>
                            <p className="text-[16px] leading-[24px] text-jv-text-black w-[300px] max-md:w-auto max-md:whitespace-pre-wrap tracking-normal">
                                {contactDetails.location}
                            </p>
                        </ContactCard>
                    </div>
                </div>
            </section>

            <section
                className="px-[150px] max-md:px-[20px] pt-[21px] pb-[23px] bg-[url('/assets/decorative_bg.png')] max-sm:bg-[#B8282E] max-sm:bg-none relative z-[1] flex items-center max-sm:flex-col max-sm:gap-[10px] justify-between">
                <h5 className="text-[14px] leading-[24px] text-white max-sm:w-[320px] max-sm:text-center">
                    &copy; Copyright Jeevan Vigyan Dham 2025 . All rights reserved
                </h5>

                <h5 className="text-[14px] leading-[24px] text-white">
                    Designed by <Link className="hover:underline" href={'https://dallotech.com'} target="_blank">
                        Dallotech
                    </Link>
                </h5>
            </section>
        </footer>
    )
}

export default Footer;

const ContactCard = ({ icon, children }) => {
    return (
        <article className="flex items-center gap-[15px]">
            <div
                className="bg-[url('/assets/benefit_index_icon.png')] bg-cover min-w-[62px] w-[62px] h-[62px] flex items-center justify-center">
                {icon}
            </div>

            {children}
        </article>
    )
}
